Fix error can't delete order, edit info user,...
